---
kind: property
id: P:Autodesk.Revit.DB.ComponentRepeaterSlot.IsDefault
source: html/74f08994-5ee8-a7a5-a1e1-6632f1176b06.htm
---
# Autodesk.Revit.DB.ComponentRepeaterSlot.IsDefault Property

A flag indicating whether the slot currently holds an instance of the default family type of the component repeater.

## Syntax (C#)
```csharp
public bool IsDefault { get; }
```